---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutFailures.CutoutNotCuttingAnythingDeleteOpening
source: html/b946bb16-ca01-d920-b00b-8b6973b27b58.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutFailures.CutoutNotCuttingAnythingDeleteOpening Property

Opening not cutting anything.

## Syntax (C#)
```csharp
public static FailureDefinitionId CutoutNotCuttingAnythingDeleteOpening { get; }
```